SoapTest/soap_config/12.update_lifecycle2.txt

<?xml version="1.0" encoding="UTF-8"?>

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
<S:Body>

<SubmitRequest xmlns="http://alcatel-lucent.com/esm/ws/svcmgr/V2_0">
    <SessionInfo>
        <sessionId>173380</sessionId>
    </SessionInfo>

    <RequestInfo>
        <ReqID></ReqID>
    </RequestInfo>


    <TaskList>
        <Task>
            <Name>Update Lifecycle</Name>
            <ParamList>
                <Param>
                    <Name>Account ID</Name>
                    <Value>886906000018</Value>
                </Param>
                <Param>
                    <Name>New State</Name>
                    <Value>ACTIVATED</Value>
                </Param>
                <Param>
                    <Name>Generate AMA</Name>
                    <Value>Y</Value>
                </Param>
                <Param>
                    <Name>Transaction ID</Name>
                    <Value>MsgSoap012</Value>
                </Param>
            </ParamList>
        </Task>
    </TaskList>
</SubmitRequest>


</S:Body>
</S:Envelope>

